Revit 2024 API
PointCloudColorSettings Constructor (PointCloudColorSettings)
 Constructs a copy of source object.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public PointCloudColorSettings(
	PointCloudColorSettings other
)
Visual Basic
Public Sub New ( _
	other As PointCloudColorSettings _
)
Visual C++
public:
PointCloudColorSettings(
	PointCloudColorSettings^ other
)
Parameters
other
Type: Autodesk.Revit.DB.PointClouds.PointCloudColorSettings
 Source object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PointCloudColorSettings Class
PointCloudColorSettings Overload
Autodesk.Revit.DB.PointClouds Namespace